name: "convolution"
input: "data"
input_dim: 1
input_dim: 1
input_dim: 400
input_dim: 400
layer {
  name: "conv"
  type: "Convolution"
  bottom: "data"
  top: "conv"
  convolution_param {
    num_output: 10
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}